/**
 * АиСД - 2020,задание 5
 * Абу Аль Лабан Н. А., БПИ 198
 * CLion 2020.2
 * Сделано:
 *  - Сортировки: Выбор минимума, Пузырек, Бинарная вставка, Подсчетом,
 *                Цифровая, Пирамидальная, Быстрая (опорный средний), слиянием
 *  - Генерация 4 видов массивов (по заданию)
 *  - Подсчет времени с помощью chrono в наносекундах
 *  - Время считается для 100 измерений, записывается в файл среднее значение
 *  - После сортировки проверяется, действительно ли числа в новом массиве стоят по возрастанию
 *  - Все взаимодействие с массивами происходит с помощью класса ArrayManager
 *  - Реализации сортировок в классе Sort
 *  - Все вспомогательные методы в классе Utility
 *  - Метод, записывающий исходный и отсортированный массивы в соответствующие файлы
 */
#include "Test.h"

int main() {
    Test t;
    t.start();

    return 0;
}
